In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame({'col1':[1,2,3,4,5,6,7],
                'col2':[111,222,333,444,555,867,789],
                'col3':['abc','efd','xyz','pqr','sxg','hgd','asx']})
df

   col1  col2 col3
0     1   111  abc
1     2   222  efd
2     3   333  xyz
3     4   444  pqr
4     5   555  sxg
5     6   867  hgd
6     7   789  asx

In [3]:
df.head()
#df.head() will show first 5 rows only
#if you pass integer argument like df.head(7) then this will show 7 rows
#df shows all dataset

   col1  col2 col3
0     1   111  abc
1     2   222  efd
2     3   333  xyz
3     4   444  pqr
4     5   555  sxg

In [4]:
df['col2'].unique()

array([111, 222, 333, 444, 555, 867, 789], dtype=int64)

In [5]:
len(df['col2'].unique())

7

In [6]:
df['col2'].nunique()

7

In [7]:
df[(df['col1']>2)]

   col1  col2 col3
2     3   333  xyz
3     4   444  pqr
4     5   555  sxg
5     6   867  hgd
6     7   789  asx

In [8]:
df[(df['col1']>2) &  (df['col2']==444)]

   col1  col2 col3
3     4   444  pqr

In [9]:
def times2(x):
    return x**2

In [10]:
df['col1'].apply(times2)

0     1
1     4
2     9
3    16
4    25
5    36
6    49
Name: col1, dtype: int64

In [11]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
4    3
5    3
6    3
Name: col3, dtype: int64

In [12]:
df['col1'].apply(lambda x:x*2)

0     2
1     4
2     6
3     8
4    10
5    12
6    14
Name: col1, dtype: int64

In [13]:
df.drop('col1',axis=1)

   col2 col3
0   111  abc
1   222  efd
2   333  xyz
3   444  pqr
4   555  sxg
5   867  hgd
6   789  asx

In [14]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [15]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [17]:
df.sort_values(by='col2')
#This is a function in pandas, a popular Python library for data manipulation and analysis. It's used to sort the rows of your DataFrame based on the values in one or more columns.

   col1  col2 col3
0     1   111  abc
1     2   222  efd
2     3   333  xyz
3     4   444  pqr
4     5   555  sxg
6     7   789  asx
5     6   867  hgd

In [19]:
df.isnull()
#This resulting DataFrame shows True where a cell in the original DataFrame df is missing and False where it contains a valid value.
#You can use the df.isnull() result to perform various operations like counting missing values, filling them with specific values, or dropping rows/columns with missing values to clean and preprocess your data.

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False

In [20]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [21]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1